experiments/data/stats/ycsb_e_run1.out
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloade -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 12084
[OVERALL], Throughput(ops/sec), 82754.05494869249
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 30
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.24826216484607747
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 30
[TOTAL_GC_TIME_%], Time(%), 0.24826216484607747
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1612288.0
[CLEANUP], MinLatency(us), 1611776
[CLEANUP], MaxLatency(us), 1612799
[CLEANUP], 50thPercentileLatency(us), 1612799
[CLEANUP], 95thPercentileLatency(us), 1612799
[CLEANUP], 99thPercentileLatency(us), 1612799
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 9.1406
[INSERT], MinLatency(us), 5
[INSERT], MaxLatency(us), 34495
[INSERT], 50thPercentileLatency(us), 9
[INSERT], 95thPercentileLatency(us), 13
[INSERT], 99thPercentileLatency(us), 16
[INSERT], Return=OK, 1000000
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloade -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 132933
[OVERALL], Throughput(ops/sec), 7522.58656616491
[TOTAL_GCS_G1_Young_Generation], Count, 98
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 937
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7048663612496521
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 98
[TOTAL_GC_TIME], Time(ms), 937
[TOTAL_GC_TIME_%], Time(%), 0.7048663612496521
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3035.0
[CLEANUP], MinLatency(us), 3034
[CLEANUP], MaxLatency(us), 3035
[CLEANUP], 50thPercentileLatency(us), 3035
[CLEANUP], 95thPercentileLatency(us), 3035
[CLEANUP], 99thPercentileLatency(us), 3035
[SCAN-LATENCY-PER-RECORD], Operations, 949614
[SCAN-LATENCY-PER-RECORD], AverageLatency(us), 2.669938522389097
[SCAN-LATENCY-PER-RECORD], MinLatency(us), 0
[SCAN-LATENCY-PER-RECORD], MaxLatency(us), 32223
[SCAN-LATENCY-PER-RECORD], 50thPercentileLatency(us), 2
[SCAN-LATENCY-PER-RECORD], 95thPercentileLatency(us), 5
[SCAN-LATENCY-PER-RECORD], 99thPercentileLatency(us), 13
[INSERT], Operations, 50386
[INSERT], AverageLatency(us), 16.712102568173698
[INSERT], MinLatency(us), 6
[INSERT], MaxLatency(us), 10727
[INSERT], 50thPercentileLatency(us), 16
[INSERT], 95thPercentileLatency(us), 23
[INSERT], 99thPercentileLatency(us), 29
[INSERT], Return=OK, 50386
[SCAN], Operations, 949614
[SCAN], AverageLatency(us), 134.80909822306748
[SCAN], MinLatency(us), 4
[SCAN], MaxLatency(us), 127999
[SCAN], 50thPercentileLatency(us), 128
[SCAN], 95thPercentileLatency(us), 249
[SCAN], 99thPercentileLatency(us), 314
[SCAN], Return=OK, 949614