experiments/data/stats/ycsb_e_run2.out
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloade -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 12137
[OVERALL], Throughput(ops/sec), 82392.68352970257
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 34
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2801351240009887
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 34
[TOTAL_GC_TIME_%], Time(%), 0.2801351240009887
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1686016.0
[CLEANUP], MinLatency(us), 1685504
[CLEANUP], MaxLatency(us), 1686527
[CLEANUP], 50thPercentileLatency(us), 1686527
[CLEANUP], 95thPercentileLatency(us), 1686527
[CLEANUP], 99thPercentileLatency(us), 1686527
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 9.121807
[INSERT], MinLatency(us), 5
[INSERT], MaxLatency(us), 37823
[INSERT], 50thPercentileLatency(us), 9
[INSERT], 95thPercentileLatency(us), 13
[INSERT], 99thPercentileLatency(us), 18
[INSERT], Return=OK, 1000000
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloade -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 129839
[OVERALL], Throughput(ops/sec), 7701.846132517964
[TOTAL_GCS_G1_Young_Generation], Count, 98
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 986
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7594020286662714
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 98
[TOTAL_GC_TIME], Time(ms), 986
[TOTAL_GC_TIME_%], Time(%), 0.7594020286662714
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2897.0
[CLEANUP], MinLatency(us), 2896
[CLEANUP], MaxLatency(us), 2897
[CLEANUP], 50thPercentileLatency(us), 2897
[CLEANUP], 95thPercentileLatency(us), 2897
[CLEANUP], 99thPercentileLatency(us), 2897
[SCAN-LATENCY-PER-RECORD], Operations, 950330
[SCAN-LATENCY-PER-RECORD], AverageLatency(us), 2.577587785295634
[SCAN-LATENCY-PER-RECORD], MinLatency(us), 0
[SCAN-LATENCY-PER-RECORD], MaxLatency(us), 2087
[SCAN-LATENCY-PER-RECORD], 50thPercentileLatency(us), 2
[SCAN-LATENCY-PER-RECORD], 95thPercentileLatency(us), 5
[SCAN-LATENCY-PER-RECORD], 99thPercentileLatency(us), 13
[INSERT], Operations, 49670
[INSERT], AverageLatency(us), 16.48371250251661
[INSERT], MinLatency(us), 6
[INSERT], MaxLatency(us), 9959
[INSERT], 50thPercentileLatency(us), 15
[INSERT], 95thPercentileLatency(us), 22
[INSERT], 99thPercentileLatency(us), 29
[INSERT], Return=OK, 49670
[SCAN], Operations, 950330
[SCAN], AverageLatency(us), 131.47612513547926
[SCAN], MinLatency(us), 4
[SCAN], MaxLatency(us), 136959
[SCAN], 50thPercentileLatency(us), 124
[SCAN], 95thPercentileLatency(us), 243
[SCAN], 99thPercentileLatency(us), 316
[SCAN], Return=OK, 950330